[SearchAndDestroy_var02 X2MissionNarrativeTemplate]
+ObjectiveTextPools[0]="找到强大的外星人"
+ObjectiveTextPools[1]="击杀外星人"
+ObjectiveTextPools[2]="消灭所有敌方目标"
+ObjectiveTextPools[3]="撤离所有XCOM士兵"

[SearchAndDestroy_var02 X2MissionTemplate]
+DisplayName="搜寻并摧毁：高级外星人"
+Briefing="发现了一种高级外星人。找到并消灭。"
+PostMissionType="搜寻并摧毁：高级外星人"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="找到并消灭外星人。"
+ObjectiveTextPools[1]="不要让ADVENT撤离外星指挥官。"
+PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_A"
+PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_B"
+PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Eliminate_Field_Command_Dropship_Intro_C"

[GOp_SearchAndDestroy_var02 X2MissionFlavorTextTemplate]
FlavorText="MISSING FLAVOR TEXT"
CouncilSpokesmanSuccessText="做得好，指挥官。对在 <XGParam:StrValue0/!WorldRegionName/> 发现的高级外星人的进攻，我们已经取得了决定性的打击。"
CouncilSpokesmanFailureText=" <XGParam:StrValue0/!WorldRegionName/>，我们最近未能阻止外星指挥官，导致我们无法追踪其去向。指挥官，我们在这里失去了宝贵的机会。"  
